JMeter-Tests/jmeter-test-plans/booking-400users.jmx
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Booking Creation Test - 400 Users" enabled="true">
      <stringProp name="TestPlan.comments">Booking Creation Test - 400 Users - 400 concurrent users</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <stringProp name="HTTPSampler.domain">af859bf4c90fe45a8a617d2337fe265b-73469934.us-west-2.elb.amazonaws.com</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments" />
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree />
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Booking Creation Test - 400 Users" enabled="true">
        <intProp name="ThreadGroup.num_threads">400</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login for Booking" enabled="true">
          <stringProp name="HTTPSampler.path">/api/traveler/auth/login</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "email": "traveler${__threadNum}@test.com",
  "password": "testpassword123",
  "userType": "traveler"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree />
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Extract token (Groovy)" enabled="true"><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="parameters" /><stringProp name="script">import groovy.json.JsonSlurper
try {
  def json = new JsonSlurper().parseText(prev.getResponseDataAsString())
  vars.put('token', json.token ?: '')
} catch (Exception ex) {
  log.error('Failed to parse token', ex)
  vars.put('token', '')
}</stringProp></JSR223PostProcessor><hashTree /></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Properties for Booking" enabled="true">
          <stringProp name="HTTPSampler.path">/api/property/properties</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments" />
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Property ID" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">propertyId</stringProp>
            <stringProp name="RegexExtractor.regex">"_id":"([^"]+)"</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
          </RegexExtractor>
          <hashTree />
        <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Process Properties" enabled="true"><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="parameters" /><stringProp name="script">import groovy.json.JsonSlurper
import java.time.LocalDate
import java.time.ZoneOffset

def data
try {
  data = new JsonSlurper().parseText(prev.getResponseDataAsString())
} catch (Exception ex) {
  log.error('Process Properties: failed to parse response', ex)
  vars.put('propertyId', '')
  def fallback = LocalDate.now(ZoneOffset.UTC).plusDays(30)
  vars.put('startDate', fallback.toString())
  vars.put('endDate', fallback.plusDays(4).toString())
  return
}
def props = data.properties ?: data.data ?: []
if (props.isEmpty()) {
  log.warn('Process Properties: no properties returned')
  vars.put('propertyId', '')
  def fallback = LocalDate.now(ZoneOffset.UTC).plusDays(30)
  vars.put('startDate', fallback.toString())
  vars.put('endDate', fallback.plusDays(4).toString())
  return
}
def threadIndex = ctx.getThreadNum()
def propIndex = threadIndex % props.size()
def sequenceIndex = (int)(threadIndex / props.size())
def prop = props[propIndex]
def propId = prop.id ?: prop._id ?: ''
vars.put('propertyId', propId.toString())

def runOffset = (System.currentTimeMillis() % 1000L) as int
def baseStart = LocalDate.now(ZoneOffset.UTC).plusDays(30 + sequenceIndex * 10 + propIndex + runOffset)
vars.put('startDate', baseStart.toString())
vars.put('endDate', baseStart.plusDays(4).toString())
log.info('Process Properties: thread=' + threadIndex + ', property=' + propId + ', start=' + vars.get('startDate'))</stringProp></JSR223PostProcessor><hashTree /></hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Booking" enabled="true">
          <stringProp name="HTTPSampler.path">/api/booking/bookings</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "propertyId": "${propertyId}",
  "startDate": "${startDate}",
  "endDate": "${endDate}",
  "guests": 2
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree />
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree />
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>